<script>
import SectionTitle from '../SectionTitle.vue';
import Service from './Service.vue';
export default {
    data() {
        return {
            services : [
                {title: "Хирургия", text: "Предлагаем Вам атипичное удаление, имплантацию, аугментацию кости провести безболезненно под сном."},
                {title: "Ортопедия", text: "К Вашим услугам - микропротезирование, установка керамических виниров, съемное протезирование, протезирование на имплантах"},
                {title: "Эндодонтия", text: "Лечение осложнений кариеса - пульпита, периодонтита проведите под контролем микроскопа нашими лучшими специалистами!"},
                {title: "Рентгенология", text: "Используем современную цифровую технику для получения наиболее точных и безопасных снимков - TROPHY и MORITA."},
                {title: "Отбеливание", text: "Получите Вашу белоснежную улыбку с американской системой отбеливания зубов «Beyond Whitening Accelerator»!"},
                {title: "Гигиена", text: "Профессиональная чистка зубов необходима для поддержания комплексного здоровья полости рта - позаботьтесь о Ваших зубах!"},
                {title: "Ортодонтия", text: "Устанавливаем невидимые, металлические, керамические, лингвальные брекеты, используя Американскую систему Damon 3-System."},
                {title: "Пародонтология", text: "Повышаем качество жизни - лечим заболевания пародонта, используя метод вектор-терапии, основанный на воздействии ультразвука. "},
                {title: "Детская стоматология", text: "Наши доктора без труда находят общий язык даже с самыми маленькими пациентами - предотвращаем возможные заболевания заранее!"}
            ]
        }
    },
    name: "Services",
    components: {
        SectionTitle,
        Service,
    }
}
</script>
<template>
    <div class="container">
        <SectionTitle title="УСЛУГИ"></SectionTitle>
        <div class="grid sm:grid-cols-1 md:grid-cols-2 lg:grid-cols-3 mt-10">
            <Service v-for="(thisService, index) in this.services" :title="thisService.title" :text="thisService.text"></Service>
        </div>
    </div>
    
</template>